//require   请求：引入模块
//module    模块：批量输出
//exports   输出：

//注：module.exports 与 exports 是一致的
//   '.js'是可选的

//var  a = 12;
//不能像上面这样直接写，因为node里面没有全局变量。所以会输出 undefined
//可以这样写:
//exports.a =  12;

//原因:
//1、防止全局变量，污染变量环境
//2、输出变量变得更加可控
//3、当写node模块的时候，系统默认转化
//  (function(require, exports, module){
//  	 // var a = 12;
//  	 // var b = 5;
//  	 //
//  	 // exports.a = 12;	
//       //立即执行函数
//       //变量不会污染全局
//  
//  })()


//module  批量输出
//例如：
//module.exports={
//	a: 12, 
//	b: 5, 
//	c: 99
//};

//------------------------------------------------------------------

//NPM: NodeJs package Manager(NodeJS包管理器)
//1、统一下载途径
//2、自动下载依赖

//------------------------------------------------------------------

// 安装： npm install xxx
// 删除： npm uninstall xx

//------------------------------------------------------------------


// 放置node_modules 模块

// 方法：
// 1、添加路径 './'
// 2、不加'./' 但是模块文件必须放置在 node_modules文件夹里面

// require
// 1、如果有'./'
// 	从当前目录找

// 2、如果没有'./'
// 	先从系统模块里面找
// 	然后再从node_modules找



